; domain
(define (domain ai_game)
	(:requirements :strips :typing :fluents :conditional-effects)
	(:types 	
		place - object		 
		person - object
		building - place
		forest - place
		resource - place		
		
	)
	
	(:functions
		(wood)
		(timber)
		(iron)
		(stored-ore)
		(stored-coal)	
		(ore ?p - place)
		(coal ?p - place)
		(min_resource)
		(stone)
		(time)
	)
	
	(:predicates
		(at ?person - person ?p - place)
		(has-building ?p - place)
		
		(has-house ?p - place)
		(has-sawmill ?p - place)
		(has-smelter ?p - place)
		(has-school ?p - place)
		(has-storage ?p - place)
		(has-oremine ?p - place)
		(has-coalmine ?p - place)
		(has-quarry ?p - place)
		(has-blacksmith ?p - place)
		(has-barracks ?p - place)
		(has-skill ?person - person)
		(has-riflemanskill ?person - person)
		
		(ore_resource ?p - place)
		(coal_resource ?p - place)
		
		(has-turfhut ?p - place)
		
		(has-timber ?person - person)
		(has-wood ?person - person)
		(has-coal ?person - person)
		(has-ore ?person - person)
		(has-iron ?person - person)
		(has-stone ?person - person)
		(has-axe ?person - person)

		(is-carpenter ?person - person)
		(is-blacksmith ?person - person)
		(is-lumberjack ?person - person)
		(is-teacher ?person - person)
		(is-miner ?person - person)
		(is-rifleman ?person - person)			
	)
	
	;; ------------- ACTIONS ---------- ;;
	
	(:action move
			:parameters (?person - person ?pl-from ?pl-to - place)
			:precondition (and (at ?person ?pl-from))
			:effect(and(at ?person ?pl-to) (not (at ?person ?pl-from)))
	)

	;;------------- Training ------------- ;;
	
	(:action simpleEducate
			:parameters(?person - person ?student - person ?place - place)
			:precondition(and(at ?person ?place) (at ?student ?place) (not(has-skill ?student)) (not(= ?person ?student)))
			:effect(and (has-skill ?student) (increase (time) 100))
	)
	
	(:action schoolEducate
			:parameters(?student - person ?teacher - person ?place - place)
			:precondition(and(at ?student ?place) (at ?teacher ?place) (is-teacher ?teacher) (has-school ?place) (not(has-skill ?student)))
			:effect(and (has-skill ?student) (increase (time) 50))
	)
	
	(:action barracksEducate
			:parameters(?student - person ?teacher - person ?place - place)
			:precondition(and(at ?student ?place) (at ?teacher ?place) (is-teacher ?teacher) (has-barracks ?place))
			:effect(and (has-riflemanskill ?student))
	)
	
	(:action trainCarpenter
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-carpenter ?person)))
			:effect(and (is-carpenter ?person) (not(has-skill ?person)))
	)
	
	(:action trainBlacksmith
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-blacksmith ?person)))
			:effect(and (is-blacksmith ?person) (not(has-skill ?person)))
	)
	
	(:action trainLumberjack
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-lumberjack ?person)))
			:effect(and (is-lumberjack ?person) (not(has-skill ?person)))
	)
	
	(:action trainTeacher
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-teacher ?person)))
			:effect(and (is-teacher ?person) (not(has-skill ?person)))
	)

	(:action trainMiner
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-miner ?person)))
			:effect(and (is-miner ?person) (not(has-skill ?person)))
	)
	
	(:action trainRifleman
			:parameters(?person - person)
			:precondition(and(has-riflemanskill ?person) (not(is-rifleman ?person)))
			:effect(and (is-rifleman ?person) (not(has-riflemanskill ?person)))
	)
	
	;; --------- Acquire Resource --------- ;;
	
	(:action cutTree
			:parameters(?lumberjack - person ?tree - forest)
			:precondition(and(is-lumberjack ?lumberjack) (at ?lumberjack ?tree))
			:effect(has-timber ?lumberjack)
	)
	
	(:action simpleMineOre
			:parameters(?person - person ?resource - resource)
			:precondition(and(>= (ore ?resource) (min_resource)))
			:effect(and(has-ore ?person) (decrease (ore ?resource) 1))
	)
	
	(:action simpleMineCoal
			:parameters(?person - person ?resource - resource)
			:precondition(and(>= (coal ?resource) (min_resource)))
			:effect(and(has-coal ?person) (decrease (coal ?resource) 1))
	)
	
	
	(:action mineOre
			:parameters(?miner - person ?mine - place)
			:precondition(and(is-miner ?miner) (at ?miner ?mine) (has-oremine ?mine))
			:effect(has-ore ?miner)
	)
	
	(:action mineCoal
			:parameters(?miner - person ?mine - place)
			:precondition(and(is-miner ?miner) (at ?miner ?mine) (has-coalmine ?mine))
			:effect(has-coal ?miner)
	)

	(:action cutStone
			:parameters(?stonecutter - person ?quarry - place)
			:precondition(and(at ?stonecutter ?quarry) (has-quarry ?quarry))
			:effect(has-stone ?stonecutter)
	)
	
	
	(:action produceWood
			:parameters(?person - person ?sawmill - place)
			:precondition(and (at ?person ?sawmill) (has-sawmill ?sawmill) (>= (timber) 1))
			:effect(and(has-wood ?person) (decrease (timber) 1))
	)
	
	(:action produceIron
			:parameters(?person - person ?smelter - place)
			:precondition(and(has-coal ?person) (>= (stored-ore) 1) (at ?person ?smelter) (has-smelter ?smelter))
			:effect(and(has-iron ?person) (decrease (stored-ore) 1) (not(has-ore ?person)))
	)
	
	(:action makeTool
			:parameters(?blacksmith - person ?place - place)
			:precondition(and(at ?blacksmith ?place) (is-blacksmith ?blacksmith) (has-smelter ?place))
			:effect(has-axe ?blacksmith)
	)
	
	;; --------- Build Building ---------- ;;
	
	(:action buildTurfHut
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (not(has-turfhut ?place)) (not(has-building ?place)))
			:effect(and(has-turfhut ?place) (has-building ?place))
	)
	
	(:action buildHouse
			:parameters(?carpenter - person ?person - person ?place - place)
			:precondition(and(at ?carpenter ?place) (at ?person ?place) (is-carpenter ?carpenter) (not(has-house ?place)) (not(has-building ?place)) (not(= ?person ?carpenter))
						  (or(has-wood ?carpenter) (has-wood ?person)))
			:effect(and(has-house ?place) (has-building ?place) (not(has-wood ?carpenter)) (not(has-wood ?person)))
	)
	
	(:action buildSmelter
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (has-stone ?person) (not(has-smelter ?place)) (not(has-building ?place)))
			:effect(and(has-smelter ?place) (has-building ?place) (not(has-stone ?person)))
	)
	
	(:action buildSchool
			:parameters(?carpenter - person ?person - person ?place - place)
			:precondition(and(at ?person ?place) (at ?carpenter ?place) (is-carpenter ?carpenter) (not(has-school ?place)) (not(has-building ?place)) (not(= ?person ?carpenter))
						  (or(has-wood ?carpenter) (has-wood ?person))
						  (or(has-iron ?carpenter) (has-iron ?person)))
			:effect(and(has-school ?place) (has-building ?place) (not(has-wood ?person)) (not(has-wood ?carpenter)) (not(has-iron ?person)) (not(has-iron ?carpenter)))
	)
	
	(:action buildSawMill
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (has-stone ?person) (not(has-building ?place)) (not(has-sawmill ?place)) (>= (timber) 1) (>= (iron) 1))
			:effect(and(has-sawmill ?place) (has-building ?place) (not(has-stone ?person)) (decrease (iron) 1) (decrease (timber) 1))
	)
	
	(:action buildOreMine
			:parameters(?carpenter - person ?blacksmith - person ?person - person ?resource - resource)
			:precondition(and(is-carpenter ?carpenter) (is-blacksmith ?blacksmith) (at ?carpenter ?resource) (at ?blacksmith ?resource) (ore_resource ?resource) (not(= ?carpenter ?blacksmith)) (not(has-oremine ?resource))
						(or(has-timber ?carpenter) (has-timber ?person)))
			:effect(and(has-oremine ?resource) (has-building ?resource))
	)
	
	(:action buildCoalMine
			:parameters(?carpenter - person ?blacksmith - person ?person - person ?resource - resource)
			:precondition(and(is-carpenter ?carpenter) (is-blacksmith ?blacksmith) (at ?carpenter ?resource) (at ?blacksmith ?resource) (coal_resource ?resource) (not (= ?carpenter ?blacksmith)) (not(has-coalmine ?resource))
						(or(has-timber ?carpenter) (has-timber ?blacksmith) (has-timber ?person)))
			:effect(and(has-coalmine ?resource) (has-building ?resource))
	)
			
	
	
		
	
	;; --------- Store Resource ---------- ;;
	
	(:action storeTimber
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-timber ?person))
			:effect(and (increase (timber) 1) (not(has-timber ?person)))
	)

	(:action storeWood
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-wood ?person))
			:effect(and (increase (wood) 1) (not(has-wood ?person)))
	)
	
	(:action storeOre
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-ore ?person))
			:effect(and (increase (stored-ore) 1) (not(has-ore ?person)))
	)
	
	(:action storeCoal
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-coal ?person))
			:effect(and (increase (stored-coal) 1) (not(has-coal ?person)))
	)
	
	(:action storeIron
			:parameters(?person - person ?storage - place)
			:precondition(and (at ?person ?storage) (has-storage ?storage) (has-iron ?person))
			:effect(and (increase (iron) 1) (not (has-iron ?person)))
	)
	
	(:action storeStone
			:parameters(?person - person ?storage - place)
			:precondition(and (at ?person ?storage) (has-storage ?storage) (has-iron ?person))
			:effect(and (increase (stone) 1) (not (has-stone ?person)))
	)
	

)

; problem
(define (problem team_problem)
(:domain ai_game)
(:objects
forest1 - forest
human1 - person
human1place - place
human2 - person
human2place - place
oreresource - resource
coalresource - resource
quarry - place
storage - place
)
(:init
(at human1 human1place)
(at human2 human2place)
(ore_resource oreresource)
(coal_resource coalresource)
(has-building oreresource)
(has-building coalresource)
(has-quarry quarry)
(has-storage storage)
(has-building forest1)
(= (time) 0)
(= (wood) 0)
(= (timber) 0)
(= (stored-ore) 0)
(= (iron) 0)
(= (min_resource) 0)
(= (ore oreresource) 5)
(= (coal coalresource) 5)
)
(:goal
(and
(= (wood) 5)
(= (timber) 10)
(= (iron) 5)
)
)
)

; plan
1. (move human1 human1place human2place)
   deleted: (at human1 human1place)
   added: (at human1 human2place)
   goals met: 0 of 3
2. (simpleeducate human2 human1 human2place)
   added: (has-skill human1)
   changed: (time) from 0 to 100
   goals met: 0 of 3
3. (simpleeducate human1 human2 human2place)
   added: (has-skill human2)
   changed: (time) from 100 to 200
   goals met: 0 of 3
4. (move human1 human2place forest1)
   deleted: (at human1 human2place)
   added: (at human1 forest1)
   goals met: 0 of 3
5. (move human2 human2place forest1)
   deleted: (at human2 human2place)
   added: (at human2 forest1)
   goals met: 0 of 3
6. (move human2 forest1 quarry)
   deleted: (at human2 forest1)
   added: (at human2 quarry)
   goals met: 0 of 3
7. (cutstone human2 quarry)
   added: (has-stone human2)
   goals met: 0 of 3
8. (move human2 quarry forest1)
   deleted: (at human2 quarry)
   added: (at human2 forest1)
   goals met: 0 of 3
9. (simplemineore human2 oreresource)
   added: (has-ore human2)
   changed: (ore oreresource) from 5 to 4
   goals met: 0 of 3
10. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
11. (storeore human2 storage)
   deleted: (has-ore human2)
   changed: (stored-ore) from 0 to 1
   goals met: 0 of 3
12. (simpleminecoal human1 coalresource)
   added: (has-coal human1)
   changed: (coal coalresource) from 5 to 4
   goals met: 0 of 3
13. (buildsmelter human2 storage)
   deleted: (has-stone human2)
   added: (has-smelter storage) (has-building storage)
   goals met: 0 of 3
14. (trainlumberjack human1)
   deleted: (has-skill human1)
   added: (is-lumberjack human1)
   goals met: 0 of 3
15. (cuttree human1 forest1)
   added: (has-timber human1)
   goals met: 0 of 3
16. (move human1 forest1 storage)
   deleted: (at human1 forest1)
   added: (at human1 storage)
   goals met: 0 of 3
17. (move human2 storage quarry)
   deleted: (at human2 storage)
   added: (at human2 quarry)
   goals met: 0 of 3
18. (cutstone human2 quarry)
   added: (has-stone human2)
   goals met: 0 of 3
19. (produceiron human1 storage)
   added: (has-iron human1)
   changed: (stored-ore) from 1 to 0
   goals met: 0 of 3
20. (storeiron human1 storage)
   deleted: (has-iron human1)
   changed: (iron) from 0 to 1
   goals met: 0 of 3
21. (storetimber human1 storage)
   deleted: (has-timber human1)
   changed: (timber) from 0 to 1
   goals met: 0 of 3
22. (move human1 storage forest1)
   deleted: (at human1 storage)
   added: (at human1 forest1)
   goals met: 0 of 3
23. (cuttree human1 forest1)
   added: (has-timber human1)
   goals met: 0 of 3
24. (move human1 forest1 storage)
   deleted: (at human1 forest1)
   added: (at human1 storage)
   goals met: 0 of 3
25. (buildsawmill human2 quarry)
   deleted: (has-stone human2)
   added: (has-sawmill quarry) (has-building quarry)
   changed: (iron) from 1 to 0, (timber) from 1 to 0
   goals met: 0 of 3
26. (storetimber human1 storage)
   deleted: (has-timber human1)
   changed: (timber) from 0 to 1
   goals met: 0 of 3
27. (producewood human2 quarry)
   added: (has-wood human2)
   changed: (timber) from 1 to 0
   goals met: 0 of 3
28. (move human2 quarry storage)
   deleted: (at human2 quarry)
   added: (at human2 storage)
   goals met: 0 of 3
29. (move human1 storage forest1)
   deleted: (at human1 storage)
   added: (at human1 forest1)
   goals met: 0 of 3
30. (simplemineore human2 oreresource)
   added: (has-ore human2)
   changed: (ore oreresource) from 4 to 3
   goals met: 0 of 3
31. (cuttree human1 forest1)
   added: (has-timber human1)
   goals met: 0 of 3
32. (move human1 forest1 storage)
   deleted: (at human1 forest1)
   added: (at human1 storage)
   goals met: 0 of 3
33. (storeore human2 storage)
   deleted: (has-ore human2)
   changed: (stored-ore) from 0 to 1
   goals met: 0 of 3
34. (storetimber human1 storage)
   deleted: (has-timber human1)
   changed: (timber) from 0 to 1
   goals met: 0 of 3
35. (move human1 storage quarry)
   deleted: (at human1 storage)
   added: (at human1 quarry)
   goals met: 0 of 3
36. (producewood human1 quarry)
   added: (has-wood human1)
   changed: (timber) from 1 to 0
   goals met: 0 of 3
37. (move human1 quarry forest1)
   deleted: (at human1 quarry)
   added: (at human1 forest1)
   goals met: 0 of 3
38. (cuttree human1 forest1)
   added: (has-timber human1)
   goals met: 0 of 3
39. (move human1 forest1 storage)
   deleted: (at human1 forest1)
   added: (at human1 storage)
   goals met: 0 of 3
40. (trainlumberjack human2)
   deleted: (has-skill human2)
   added: (is-lumberjack human2)
   goals met: 0 of 3
41. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
42. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
43. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
44. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 0 to 1
   goals met: 0 of 3
45. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
46. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
47. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
48. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 1 to 2
   goals met: 0 of 3
49. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
50. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
51. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
52. (simpleminecoal human2 coalresource)
   added: (has-coal human2)
   changed: (coal coalresource) from 4 to 3
   goals met: 0 of 3
53. (produceiron human1 storage)
   added: (has-iron human1)
   changed: (stored-ore) from 1 to 0
   goals met: 0 of 3
54. (simplemineore human2 oreresource)
   added: (has-ore human2)
   changed: (ore oreresource) from 3 to 2
   goals met: 0 of 3
55. (storeore human2 storage)
   deleted: (has-ore human2)
   changed: (stored-ore) from 0 to 1
   goals met: 0 of 3
56. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 2 to 3
   goals met: 0 of 3
57. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
58. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
59. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
60. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 3 to 4
   goals met: 0 of 3
61. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
62. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
63. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
64. (produceiron human2 storage)
   added: (has-iron human2)
   changed: (stored-ore) from 1 to 0
   goals met: 0 of 3
65. (storeiron human2 storage)
   deleted: (has-iron human2)
   changed: (iron) from 0 to 1
   goals met: 0 of 3
66. (simplemineore human2 oreresource)
   added: (has-ore human2)
   changed: (ore oreresource) from 2 to 1
   goals met: 0 of 3
67. (storeore human2 storage)
   deleted: (has-ore human2)
   changed: (stored-ore) from 0 to 1
   goals met: 0 of 3
68. (produceiron human2 storage)
   added: (has-iron human2)
   changed: (stored-ore) from 1 to 0
   goals met: 0 of 3
69. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 4 to 5
   goals met: 0 of 3
70. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
71. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
72. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
73. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 5 to 6
   goals met: 0 of 3
74. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
75. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
76. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
77. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 6 to 7
   goals met: 0 of 3
78. (storewood human2 storage)
   deleted: (has-wood human2)
   changed: (wood) from 0 to 1
   goals met: 0 of 3
79. (move human2 storage quarry)
   deleted: (at human2 storage)
   added: (at human2 quarry)
   goals met: 0 of 3
80. (producewood human2 quarry)
   added: (has-wood human2)
   changed: (timber) from 7 to 6
   goals met: 0 of 3
81. (move human2 quarry forest1)
   deleted: (at human2 quarry)
   added: (at human2 forest1)
   goals met: 0 of 3
82. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
83. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
84. (storeiron human2 storage)
   deleted: (has-iron human2)
   changed: (iron) from 1 to 2
   goals met: 0 of 3
85. (storeiron human1 storage)
   deleted: (has-iron human1)
   changed: (iron) from 2 to 3
   goals met: 0 of 3
86. (simplemineore human2 oreresource)
   added: (has-ore human2)
   changed: (ore oreresource) from 1 to 0
   goals met: 0 of 3
87. (storeore human2 storage)
   deleted: (has-ore human2)
   changed: (stored-ore) from 0 to 1
   goals met: 0 of 3
88. (produceiron human1 storage)
   added: (has-iron human1)
   changed: (stored-ore) from 1 to 0
   goals met: 0 of 3
89. (storeiron human1 storage)
   deleted: (has-iron human1)
   changed: (iron) from 3 to 4
   goals met: 0 of 3
90. (simplemineore human2 oreresource)
   added: (has-ore human2)
   changed: (ore oreresource) from 0 to -1
   goals met: 0 of 3
91. (storeore human2 storage)
   deleted: (has-ore human2)
   changed: (stored-ore) from 0 to 1
   goals met: 0 of 3
92. (produceiron human2 storage)
   added: (has-iron human2)
   changed: (stored-ore) from 1 to 0
   goals met: 0 of 3
93. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 6 to 7
   goals met: 0 of 3
94. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
95. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
96. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
97. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 7 to 8
   goals met: 0 of 3
98. (storetimber human1 storage)
   deleted: (has-timber human1)
   changed: (timber) from 8 to 9
   goals met: 0 of 3
99. (move human2 storage forest1)
   deleted: (at human2 storage)
   added: (at human2 forest1)
   goals met: 0 of 3
100. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
101. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
102. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 9 to 10
   goals met: 1 of 3
103. (storewood human2 storage)
   deleted: (has-wood human2)
   changed: (wood) from 1 to 2
   goals met: 1 of 3
104. (storewood human1 storage)
   deleted: (has-wood human1)
   changed: (wood) from 2 to 3
   goals met: 1 of 3
105. (move human1 storage quarry)
   deleted: (at human1 storage)
   added: (at human1 quarry)
   goals met: 1 of 3
106. (move human2 storage quarry)
   deleted: (at human2 storage)
   added: (at human2 quarry)
   goals met: 1 of 3
107. (producewood human1 quarry)
   added: (has-wood human1)
   changed: (timber) from 10 to 9
   goals met: 0 of 3
108. (producewood human2 quarry)
   added: (has-wood human2)
   changed: (timber) from 9 to 8
   goals met: 0 of 3
109. (move human1 quarry forest1)
   deleted: (at human1 quarry)
   added: (at human1 forest1)
   goals met: 0 of 3
110. (move human2 quarry forest1)
   deleted: (at human2 quarry)
   added: (at human2 forest1)
   goals met: 0 of 3
111. (cuttree human1 forest1)
   added: (has-timber human1)
   goals met: 0 of 3
112. (move human1 forest1 storage)
   deleted: (at human1 forest1)
   added: (at human1 storage)
   goals met: 0 of 3
113. (cuttree human2 forest1)
   added: (has-timber human2)
   goals met: 0 of 3
114. (move human2 forest1 storage)
   deleted: (at human2 forest1)
   added: (at human2 storage)
   goals met: 0 of 3
115. (storeiron human2 storage)
   deleted: (has-iron human2)
   changed: (iron) from 4 to 5
   goals met: 1 of 3
116. (storetimber human2 storage)
   deleted: (has-timber human2)
   changed: (timber) from 8 to 9
   goals met: 1 of 3
117. (storetimber human1 storage)
   deleted: (has-timber human1)
   changed: (timber) from 9 to 10
   goals met: 2 of 3
118. (storewood human2 storage)
   deleted: (has-wood human2)
   changed: (wood) from 3 to 4
   goals met: 2 of 3
119. (storewood human1 storage)
   deleted: (has-wood human1)
   changed: (wood) from 4 to 5
   goals met: 3 of 3
